// alert("Hello world!");

// Задание 2 (тайминг 25 минут)
// Текст задания
// 1. Создайте переменную num и присвойте ей значение 123. Выведите
// значение этой переменной в консоль
// 2. Создайте переменную а и присвойте ей значение 5, переопределите
// переменную а на значение 7, выведите переменную а в консоль
// 3. Создайте переменную b. Запишите в нее сумму чисел 1, 2 и 3. С помощью функции console.log выведите в консоль содержимое
// переменной b.
// 4. Создайте 2 вида комментариев в вашем коде, добавьте в них
// произвольный текст 
// let num = 123;
// console.log(num);

// let a = 5;
// a = 7;
// console.log(a);

// let b = 1 + 2 + 3;
// console.log(b);

// Задание 3 (тайминг 20 минут)
// 1. Создайте переменную c со значением 10 и переменную d со значением 2.

// let c = 10;
// let d = 2;

// a. Все созданные переменные должны быть логично названы
// b. Создайте переменную суммы и присвойте сумму чисел (c,d)

// let sum = c + d;
// console.log(sum);

// c. Создайте переменную разности и присвойте разность чисел
// (c,d)

// let dif = c - d;
// console.log(dif);
// d. Создайте переменную прозведения и присвойте произведение // чисел (c,d)

// let mult = c * d;
// console.log(mult);

// e. Создайте переменную частного и присвойте деление чисел
// (c,d)

// let div = c / d;
// console.log(div);

// f. Выведите в консоль все созданные переменные
// g. Сложите все созданные переменные и выведите результат в консоль

// let result = sum + dif + mult + div;
// console.log(result);

// Задание 5 (тайминг 5 минут)
// 1. Запишите в переменную a число 1.5, а в переменную b - число 0.75. Найдите сумму значений этих переменных и выведите ее на экран.

// let a = 1.5;
// let b = 0.75;
// console.log(a + b, sum);

// 2. Создайте переменную a, запишите в нее какое-нибудь положительное или отрицательное число. Выведите на экран это число с обратным знаком.

// let a = -5;
// console.log(-a);

// Задание 6 (тайминг 15 минут)
// 1. Создайте строку с вашем именем и строку с вашей фамилией. Выведите эти данные в консоль

// const firstName = 'Xenia';
// const lastName = 'Golbraykh';
// console.log(firstName, lastName);

// 2. Создайте переменную с текстом 'java' и переменную с текстом 'script'. С помощью этих переменных и операции сложения строк выведите в консоль строку 'javascript'.

// let part1 = 'java';
// let part2 = 'script';
// console.log(part1 + part2);

// 3. Создайте переменную с текстом 'hello' и переменную с текстом 'world'. С помощью этих переменных и операции сложения строк выведите в консоль строку 'hello world'.
// let part1 = 'hello';
// let part2 = 'world';
// let str = part1 + " " + part2;
// console.log(str)
