// Задание 1 (тайминг 15 минут)
// Текст задания
// 1. Создать новый файл lesson2.html
// 2. Создать переменную и спросить у пользователя “Ваш
// возраст”
// 3. Вывести на экран текст. Вам “возраст пользователя” лет
// 4. Спросить у пользователя его имя
// 5. Вывести на экран, Добро пожаловать на сайт “Имя
// пользователя”

// let age = Number(prompt("Ваш возраст: "));
// let name = prompt("Ваше имя: ");
// console.log(age, name);


// Задание 2 (тайминг 15 минут)
// Текст задания
// 1. Найти остаток от деления двух переменных
// a. let a = 13;
// b. let b = 5;
// let div = 13 % 5; 3
// console.log(div);
// 2. Что выведет на экран (Сначала проговорите, потом проверьте)
// let a;
// alert(a); undefined
// 3. Что выведет на экран (Сначала проговорите, потом проверьте)
// alert('abc' * 3); NaN
// 4. Что выведет на экран (Сначала проговорите, потом проверьте)
// alert(1 / 0); Infinity
// alert(-1 / 0); -Infinity
// 5. Что выведет на экран (Сначала проговорите, потом проверьте)
// // alert('2' * '3'); 6


// Задание 3 (тайминг 15 минут)
// 1. Сознательно допустите ошибку в вашем коде. Убедитесь, что ошибка появляется в консоли. Определите, в какой строке кода случилась ошибка.
// 2. Необходимо вывести в консоль результат суммы данных переменных
// let a = '2';
// let b = '3';
// console.log(sum = a + b);
// // 3. Пользователь с клавиатуры вводит 2 числа, необходимо в консоль
// // вывести текст
// num1 = Number(prompt("Введите первое число: "));
// num2 = Number(prompt("Введите второе число: "));
// console.log('Сумма чисел равна:', sum1 = num1 + num2);
// console.log('Разность чисел равнa:', div = num1 - num2);
// console.log('Произведение чисел равно', mult = num1 * num2);
// console.log('Частное чисел равно равно', dif = num1 / num2);
// console.log('Остаток от деления чисел равен', dif1 = num1 % num2);
